<h2>Pandas Dataframe Columns

Create a pandas column using for loop

In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame({'Name':['Smriti','Srishti','Tanisha','Lata','Shivam','Jasman','Ishan'],
                 'Age':[21,24,36,42,12,np.NAN,18]})
df

      Name   Age
0   Smriti  21.0
1  Srishti  24.0
2  Tanisha  36.0
3     Lata  42.0
4   Shivam  12.0
5   Jasman   NaN
6    Ishan  18.0

In [6]:
eligible=[]
for age in df['Age']:
    if age>=18:
        eligible.append('Yes')
    else:
        eligible.append('No')

df['Voter']=eligible
df

      Name   Age Voter
0   Smriti  21.0   Yes
1  Srishti  24.0   Yes
2  Tanisha  36.0   Yes
3     Lata  42.0   Yes
4   Shivam  12.0    No
5   Jasman   NaN    No
6    Ishan  18.0   Yes

How to get column names in Pandas dataframe

In [7]:
df=pd.read_csv('nba.csv')
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [8]:
for col in df.columns:
    print(col)

Name
Team
Number
Position
Age
Height
Weight
College
Salary

In [9]:
sorted(df)

['Age',
 'College',
 'Height',
 'Name',
 'Number',
 'Position',
 'Salary',
 'Team',
 'Weight']

Get unique values from a column in Pandas DataFrame

In [16]:
data = {
    'A':['A1', 'A2', 'A3', 'A4', 'A5'], 
    'B':['B1', 'B2', 'B3', 'B4', 'B4'], 
    'C':['C1', 'C2', np.nan, 'C3', 'C3'], 
    'D':['D1', 'D2', 'D2', 'D2', 'D2'], 
    'E':['E1', 'E1', 'E1', 'E1', 'E1'] }
df=pd.DataFrame(data)
df.B.unique

<bound method Series.unique of 0    B1
1    B2
2    B3
3    B4
4    B4
Name: B, dtype: object>

In [17]:
df.C.nunique(dropna=True)

3

Conditional operation on Pandas DataFrame columns

In [25]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Product':['Umbrella', 'Mattress', 'Badminton', 'Shuttle'],
                   'Last Price':[1200, 1500, 1600, 352],
                   'Updated Price':[1250, 1450, 1550, 400],
                   'Discount':[10, 10, 10, 10]})
df

        Date    Product  Last Price  Updated Price  Discount
0  10/2/2011   Umbrella        1200           1250        10
1  11/2/2011   Mattress        1500           1450        10
2  12/2/2011  Badminton        1600           1550        10
3  13/2/2011    Shuttle         352            400        10

In [26]:
if 'Updated Price' in df.columns:
    df['Final Price']=df['Last Price']-(df['Updated Price']*0.01)
else:
    df['Final Price']=df['Last Price']-(df['Last Price']*0.01)

df

        Date    Product  Last Price  Updated Price  Discount  Final Price
0  10/2/2011   Umbrella        1200           1250        10       1187.5
1  11/2/2011   Mattress        1500           1450        10       1485.5
2  12/2/2011  Badminton        1600           1550        10       1584.5
3  13/2/2011    Shuttle         352            400        10        348.0

Return the Index label if some condition is satisfied over a column in Pandas Dataframe

In [34]:
df=pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Product':['Umbrella', 'Mattress', 'Badminton', 'Shuttle'],
                   'Last_Price':[1200, 1500, 1600, 352],
                   'Updated_Price':[1250, 1450, 1550, 400],
                   'Discount':[10, 10, 10, 10]})
df.index=['Item1','Item2','Item3','Item4']
df

            Date    Product  Last_Price  Updated_Price  Discount
Item1  10/2/2011   Umbrella        1200           1250        10
Item2  11/2/2011   Mattress        1500           1450        10
Item3  12/2/2011  Badminton        1600           1550        10
Item4  13/2/2011    Shuttle         352            400        10

In [35]:
ind=df[df['Updated_Price']>1000].index.to_list()
print(ind)

['Item1', 'Item2', 'Item3']

Using dictionary to remap values in Pandas DataFrame columns

In [36]:
df = pd.DataFrame({'Date': ['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                   'Event': ['Music', 'Poetry', 'Theatre', 'Comedy'],
                   'Cost': [10000, 5000, 15000, 2000]})
df

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

In [37]:
dict={'Music':'M','Poetry':'P','Theatre':'T','Comedy':'C'}
dict

{'Music': 'M', 'Poetry': 'P', 'Theatre': 'T', 'Comedy': 'C'}

In [40]:
df.replace(df['Event'],dict)
df

        Date Event   Cost
0  10/2/2011     M  10000
1  11/2/2011     P   5000
2  12/2/2011     T  15000
3  13/2/2011     C   2000

In [38]:
df['Event']=df['Event'].map(dict)
df

        Date Event   Cost
0  10/2/2011     M  10000
1  11/2/2011     P   5000
2  12/2/2011     T  15000
3  13/2/2011     C   2000

Create a new column in Pandas DataFrame based on the existing columns

In [41]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})
df

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

In [45]:
df['Discounted_Price']=df.apply(lambda row:row.Cost-(0.1*row.Cost),axis=1)
df

        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000            9000.0
1  11/2/2011   Poetry   5000            4500.0
2  12/2/2011  Theatre  15000           13500.0
3  13/2/2011   Comedy   2000            1800.0

Creating a Pandas dataframe column based on a given condition

In [46]:
df = pd.DataFrame({'Date' : ['11/8/2011', '11/9/2011', '11/10/2011',
                                        '11/11/2011', '11/12/2011'],
                'Event' : ['Music', 'Poetry', 'Music', 'Comedy', 'Poetry']})
df

         Date   Event
0   11/8/2011   Music
1   11/9/2011  Poetry
2  11/10/2011   Music
3  11/11/2011  Comedy
4  11/12/2011  Poetry

Creating a Pandas dataframe column based on a given condition

In [47]:
df = pd.DataFrame({'Date' : ['11/8/2011', '11/9/2011', '11/10/2011',
                                        '11/11/2011', '11/12/2011'],
                'Event' : ['Music', 'Poetry', 'Music', 'Comedy', 'Poetry']})
df

         Date   Event
0   11/8/2011   Music
1   11/9/2011  Poetry
2  11/10/2011   Music
3  11/11/2011  Comedy
4  11/12/2011  Poetry

In [49]:
df['Price']=[1500 if x=='Music' else 800 for x in df['Event']]
df

         Date   Event  Price
0   11/8/2011   Music   1500
1   11/9/2011  Poetry    800
2  11/10/2011   Music   1500
3  11/11/2011  Comedy    800
4  11/12/2011  Poetry    800

Split a column in Pandas dataframe and get part of it

In [50]:
df = pd.DataFrame({'Geek_ID':['Geek1_id', 'Geek2_id', 'Geek3_id', 
                                         'Geek4_id', 'Geek5_id'],
                'Geek_A': [1, 1, 3, 2, 4],
                'Geek_B': [1, 2, 3, 4, 6],
                'Geek_R': np.random.randn(5)})
df

    Geek_ID  Geek_A  Geek_B    Geek_R
0  Geek1_id       1       1 -0.208837
1  Geek2_id       1       2 -1.001849
2  Geek3_id       3       3 -0.952833
3  Geek4_id       2       4  0.319344
4  Geek5_id       4       6  0.261553

In [53]:
print(df['Geek_ID'].str.split('_').str[0])

0    Geek1
1    Geek2
2    Geek3
3    Geek4
4    Geek5
Name: Geek_ID, dtype: object

Getting Unique values from a column in Pandas dataframe

In [54]:
gapminder_csv_url ='http://bit.ly/2cLzoxH'
# load the data with pd.read_csv
record = pd.read_csv(gapminder_csv_url)
  
record.head()

       country  year         pop continent  lifeExp   gdpPercap
0  Afghanistan  1952   8425333.0      Asia   28.801  779.445314
1  Afghanistan  1957   9240934.0      Asia   30.332  820.853030
2  Afghanistan  1962  10267083.0      Asia   31.997  853.100710
3  Afghanistan  1967  11537966.0      Asia   34.020  836.197138
4  Afghanistan  1972  13079460.0      Asia   36.088  739.981106

In [65]:
print(record['continent'].unique())

['Asia' 'Europe' 'Africa' 'Americas' 'Oceania']

Getting frequency counts of a columns in Pandas DataFrame

In [66]:
df = pd.DataFrame({'A': ['foo', 'bar', 'g2g', 'g2g', 'g2g',
                         'bar', 'bar', 'foo', 'bar'],
                  'B': ['a', 'b', 'a', 'b', 'b', 'b', 'a', 'a', 'b'] })
df

     A  B
0  foo  a
1  bar  b
2  g2g  a
3  g2g  b
4  g2g  b
5  bar  b
6  bar  a
7  foo  a
8  bar  b

In [68]:
print(df['A'].value_counts())

bar    4
g2g    3
foo    2
Name: A, dtype: int64

In [71]:
print(df.groupby('A').count())

     B
A
bar  4
foo  2
g2g  3

Get the index of maximum value in DataFrame column

In [72]:
df=pd.read_csv('nba.csv')
df.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [75]:
print(df['Salary'].idxmax())

109

Get the index of minimum value in DataFrame column

In [76]:
print(df['Salary'].idxmin())

32

Get n-largest values from a particular column in Pandas DataFrame

In [78]:
df=pd.read_csv('nba.csv')
df.nlargest(5,['Age'])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
298,Tim Duncan,San Antonio Spurs,21.0,C,40.0,6-11,250.0,Wake Forest,5250000.0
304,Andre Miller,San Antonio Spurs,24.0,PG,40.0,6-3,200.0,Utah,250750.0
400,Kevin Garnett,Minnesota Timberwolves,21.0,PF,40.0,6-11,240.0,NaN,8500000.0
102,Pablo Prigioni,Los Angeles Clippers,9.0,PG,39.0,6-3,185.0,NaN,947726.0
261,Vince Carter,Memphis Grizzlies,15.0,SG,39.0,6-6,220.0,North Carolina,4088019.0

Get n-smallest values from a particular column in Pandas DataFrame

In [79]:
df.nsmallest(5,['Age'])

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
122,Devin Booker,Phoenix Suns,1.0,SG,19.0,6-6,206.0,Kentucky,2127840.0
226,Rashad Vaughn,Milwaukee Bucks,20.0,SG,19.0,6-6,202.0,UNLV,1733040.0
13,James Young,Boston Celtics,13.0,SG,20.0,6-6,215.0,Kentucky,1749840.0
40,Kristaps Porzingis,New York Knicks,6.0,PF,20.0,7-3,240.0,NaN,4131720.0
56,Jahlil Okafor,Philadelphia 76ers,8.0,C,20.0,6-11,275.0,Duke,4582680.0

How to drop one or multiple columns in Pandas Dataframe

In [80]:
data = {
    'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
    'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
    'C': ['C1', 'C2', 'C3', 'C4', 'C5'],
    'D': ['D1', 'D2', 'D3', 'D4', 'D5'],
    'E': ['E1', 'E2', 'E3', 'E4', 'E5']}
df=pd.DataFrame(data)
df

    A   B   C   D   E
0  A1  B1  C1  D1  E1
1  A2  B2  C2  D2  E2
2  A3  B3  C3  D3  E3
3  A4  B4  C4  D4  E4
4  A5  B5  C5  D5  E5

In [83]:
df.drop(['A'],axis=1)

    B   C   D   E
0  B1  C1  D1  E1
1  B2  C2  D2  E2
2  B3  C3  D3  E3
3  B4  C4  D4  E4
4  B5  C5  D5  E5

How to lowercase strings in a column in Pandas dataframe

In [84]:
df = pd.DataFrame({'A': ['John', 'bODAY', 'MinA', 'Peter', 'nicky'],
                  'B': ['masters', 'graduate', 'graduate',
                                   'Masters', 'Graduate'],
                  'C': [27, 23, 21, 23, 24]})
df

       A         B   C
0   John   masters  27
1  bODAY  graduate  23
2   MinA  graduate  21
3  Peter   Masters  23
4  nicky  Graduate  24

In [85]:
df['A'].apply(lambda x:x.lower())

0     john
1    boday
2     mina
3    peter
4    nicky
Name: A, dtype: object

Capitalize first letter of a column in Pandas dataframe

In [88]:
df['A'].apply(lambda x:x.capitalize())

0     John
1    Boday
2     Mina
3    Peter
4    Nicky
Name: A, dtype: object

Apply uppercase to a column in Pandas dataframe

In [89]:
df['A'].apply(lambda x:x.upper())

0     JOHN
1    BODAY
2     MINA
3    PETER
4    NICKY
Name: A, dtype: object